Revit 2027 API
AssemblyMemberDifferentCategory Class
 The two assembly members being compared have different category
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.AssemblyMemberDifference
 Autodesk.Revit.DB.AssemblyMemberDifferentCategory
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AssemblyMemberDifferentCategory : AssemblyMemberDifference
Public Class AssemblyMemberDifferentCategory
	Inherits AssemblyMemberDifference
public ref class AssemblyMemberDifferentCategory : public AssemblyMemberDifference
type AssemblyMemberDifferentCategory =
    class
        inherit AssemblyMemberDifference
    end
The AssemblyMemberDifferentCategory type exposes the following members.
Properties
Name | Description
CategoryId1 |  Category id of the first assembly member
CategoryId2 |  Category id of the second assembly member
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from AssemblyMemberDifference)
Top
Methods
Name | Description
Dispose
(Inherited from AssemblyMemberDifference)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace